Repository: andrey-yantsen/TourGuideBot-tg
Catalog: tour_guide_bot/locales/*/LC_MESSAGES/tour_guide_bot.po
Languages: ru

# cli
source: Enable debug logging.
ru: Включить отладочное логирование.

# cli
source: Comma-separated list of available languages.
ru: Список доступных языков, разделённый запятыми.

# cli
source: Default language. If not provided, will be set to the first enabled language.
ru: Язык по умолчанию. Если он не указан, будет установлен на первый активированный язык.

# cli
source: Telegram Bot token for the Guide Bot.
ru: Токен Telegram-бота для бота-гида.

# cli
source: SQLAlchemy engine URL
ru: параметры доступа к БД в формате SQLAlchemy engine URL.

# cli
source: Enable HTTP server.
ru: Активировать HTTP-сервер.

# cli
source: HTTP-server host.
ru: Адрес HTTP-сервера.

# cli
source: HTTP-server port.
ru: Порт HTTP-сервера.

# cli
source: Cookie encryption key.
ru: Ключ шифрования cookie.

# cli
source: You need to provide a cookie encryption key for the HTTP server to work. Please re-run the server providing argument --http-cookie-key='{}'
ru: Вам необходимо предоставить ключ шифрования cookie для работы HTTP-сервера. Пожалуйста, перезапустите сервер, предоставив аргумент --http-cookie-key='{}'

# cli
source: the list of enabled languages must not be empty
ru: список включенных языков не должен быть пустым

# cli
source: the default language must be in the list of enabled languages
ru: язык по умолчанию должен быть в списке доступных языков

# cli
source: Up and runnig!
ru: Работаем!

# guide-bot-notification
source: Hey! You have a new tour available — "{0}". Send /tours to start the journey!
ru: Эй! Вам доступна новая экскурсия — «{0}». Отправьте /tours, чтобы начать приключение!

# admin-approve
source: I've failed to parse your input; please enter a valid positive number.
ru: Не удалось обработать введенные данные. Пожалуйста, отправьте положительное число.

# admin-approve
source: Phone number +{0} was approved for the tour '{1}' until {2}.
ru: Телефон +{0} был утвержден для экскурсии '{1}' до {2}.

# admin-generic
source: The contact you sent me doesn't have a phone number; please try again.
ru: У отправленного Вами контакта нет телефонного номера; пожалуйста, попробуйте еще раз.

# admin-approve
source: How long the user should have access? Please enter a duration in days.
ru: Как долго пользователь должен иметь доступ? Пожалуйста, введите длительность в днях.

# admin-approve
source: Enter the phone number that should be able to access the tour (with country code), or share the contact. Send /cancel at any time if you want to abort.
ru: Введите номер телефона, которому хотите предоставить доступ к экскурсии (с кодом страны), или поделитесь контактом. Отправьте /cancel в любое время, если вы хотите прервать ввод.

# admin-generic
source: Unfortunately, you don't have any tours available for the guests.
ru: К сожалению, у вас нет ни одной экскурсии для гостей.

# bot-generic
source: Abort
ru: Отменить

# admin-generic
source: Please select the tour.
ru: Пожалуйста, выберите экскурсию.

# admin-bot-command
source: Return to the guest mode
ru: Вернуться в гостевой режим

# admin-bot-command
source: Change bot's preferences
ru: Изменить настройки бота

# admin-bot-command
source: Manage your tours
ru: Управление экскурсиями

# admin-bot-command
source: Grant access to a tour for somebody
ru: Предоставить кому-то доступ к экскурсии

# admin-bot-command
source: Revoke access to a tour from somebody
ru: Отозвать доступ к экскурсии у кого-то

# admin-bot-command
source: Change the language
ru: Изменить язык

# admin-help
source: Please send me your contact.
ru: Пожалуйста, пришлите мне ваш контакт.

# admin-help
source: Please send me the magic word.
ru: Пожалуйста, пришлите мне волшебное слово.

# admin-help
source: You can use the following commands: * /configure — to change the bot's settings * /tours — to manage your tours * /approve — to allow the access to a tour to somebody * /revoke — to revoke somebody's access to a tour * /language — to change the interface language * /guest — return to the guest mode
ru: Вы можете использовать следующие команды: * /configure — для изменения настроек бота * /tours — для управления экскурсиями * /approve — разрешить доступ к экскурсиям * /revoke — отозвать доступ к экскурсиям * /language — для изменения языка интерфейса * /guest — вернуться к гостевому режиму

# bot-generic
source: Something went wrong; please try again.
ru: Что-то пошло не так. Пожалуйста, попытайтесь еще раз.

# admin-revoke
source: Access to "{0}" was revoked from +{1}.
ru: Доступ к "{0}" был отозван у +{1}.

# admin-revoke
source: I don't see anybody with that phone number in the database; please send another one.
ru: Я никого не вижу в базе данных с таким номером; пожалуйста, отправьте другой.

# admin-revoke
source: This phone number doesn't have access to that tour; aborting.
ru: Этот номер телефона не имеет доступа к выбранной экскурсии; отмена.

# admin-revoke
source: Are you sure you want to revoke the access to "{0}" from +{1}?
ru: Вы уверены, что хотите отозвать доступ к "{0}" у +{1}?

# bot-generic
source: Yes
ru: Да

# admin-revoke
source: Enter the phone number from which you want to revoke access to the tour (with country code) or share the contact. Send /cancel at any time if you wish to cancel.
ru: Введите номер телефона, для которого вы хотите отменить доступ к экскурсии (с кодом страны), или поделитесь контактом. Отправьте /cancel в любое время, если вы хотите прервать операцию.

# admin-bot-start
source: Share phone number
ru: Поделиться номером телефона

# admin-bot-start
source: Please send me your contact number and not somebody else's.
ru: Мне нужен ваш номер телефона, а не кого-то из ваших знакомых.

# admin-bot-start
source: Admin permissions confirmed! Use /help command if you need further help.
ru: Права администратора подтверждены! Отправьте /help для дальнейшей помощи.

# admin-bot-start
source: I still don't recognize you, sorry. Try saying /admin again when you're ready.
ru: Я до сих пор не знаю Вас, извините. Попробуйте сказать /admin снова, когда будете готовы повторить.

# admin-bot-start
source: You're in guest mode now, bye!
ru: Теперь вы в гостевом режиме!

# admin-bot-start
source: Welcome to the admin mode!
ru: Добро пожаловать в режим администратора!

# admin-bot-start
source: I don't recognize you! Please send me your phone number.
ru: Я вас не узнаю! Пожалуйста, отправьте мне ваш номер телефона.

# admin-configure
source: Please select the parameter you want to change.
ru: Пожалуйста, выберите параметр, который вы хотите изменить.

# admin-configure
source: Audio-to-voice suggestions
ru: Конвертация аудио в голосовые сообщения

# admin-configure
source: Audio\-to\-voice conversion suggestions are currently *enabled*\. Would you like to disable them?
ru: Конвертация аудиозаписей в голосовые сообщения *включена*\. Хотите выключить?

# admin-configure
source: Audio\-to\-voice conversion suggestions are currently *disabled*\. Would you like to enable them?
ru: Конвертация аудоизаписей в голосовые сообщения *выключена*\. Хотите включить?

# admin-configure
source: Audio-to-voice conversion suggestions were enabled.
ru: Конвертация аудиозаписей в голосовые сообщения включена.

# admin-configure
source: Audio-to-voice conversion suggestions were disabled.
ru: Конвертация аудиозаписей в голосовые сообщения выключена.

# admin-configure
source: Delay between messages
ru: Задержка между сообщениями

# admin-configure
source: Current delay between messages is %0.1fs. Please enter a desired delay (float value between 0 and 4.5).
ru: Текущая задержка между сообщениями равна %0.1fс. Пожалуйста, введите желаемую задержку (число между 0 и 4.5).

# admin-configure
source: Please enter a float value between 0 and 4.5.
ru: Пожалуйста, введите число между 0 и 4.5.

# admin-configure
source: The delay was updated!
ru: Задержка была обновлена!

# admin-configure
source: Please select the language for the {} you want to edit.
ru: Выберите язык {}, который вы хотите отредактировать.

# admin-configure
source: The bot currently has the following {}. Please send me a new one if you want to change it, or send /cancel to abort the modification.
ru: Бот в данный момент имеет следующее {}. Пожалуйста, пришлите мне новый текст, если вы хотите изменить его, или отправьте /cancel для отмены изменений.

# admin-configure
source: The bot currently doesn't have a {}. Please send me one.
ru: В настоящее время у бота нет {}. Пожалуйста, пришлите мне нужный текст.

# admin-configure
source: Please send me a regular text message.
ru: Пожалуйста, пришлите мне обычное текстовое сообщение.

# admin-configure
source: Bot's {} has been changed.
ru: {} бота было изменено.

# admin-configure
source: Support message
ru: Сообщение с информацией о поддержке

# admin-configure
source: support message
ru: сообщение с информацией о поддержке

# admin-configure
source: Terms & Conditions
ru: Условия использования

# admin-configure
source: terms & conditions
ru: условия использования

# admin-configure
source: Guide welcome message
ru: Приветственное сообщение

# admin-configure
source: welcome message
ru: приветственное сообщение

# admin-configure
source: Payments
ru: Оплата

# bot-generic
source: « Back
ru: « Назад

# admin-configure
source: Please select the payment-related parameter you want to change.
ru: Пожалуйста, выберите настройки оплаты, который вы хотите изменить.

# admin-configure
source: You need to set up Terms & Conditions and support messages first.
ru: Сначала необходимо настроить условия использования и сообщение с информацией о поддержке.

# admin-configure
source: Add payment token
ru: Добавить платёжный токен

# admin-configure
source: Please send me the name of the payment provider you want to set up (this value will be used later for your convenience).
ru: Пожалуйста, пришлите мне название платежного провайдера, который вы хотите настроить (это значение будет использовано позже для вашего удобства).

# admin-configure
source: Great! Now send me the payment token.
ru: Отлично! Теперь пришлите мне платёжный токен.

# admin-configure
source: Payment provider has been added.
ru: Платёжный провайдер добавлен.

# admin-configure
source: Change payment token
ru: Изменить платёжный токен

# admin-configure
source: Payment token has been updated.
ru: Платёжный токен обновлён.

# admin-configure
source: Delete payment token
ru: Удалить платёжный токен

# admin-configure
source: The payment token has been deleted.
ru: Платёжный токен удалён.

# admin-tour
source: Please select an action.
ru: Пожалуйста выберите действие.

# admin-tour
source: Please send me the title for the tour, or send /cancel to abort. Do not use any formatting here.
ru: Пожалуйста, пришлите мне название экскурсии, или отправьте /cancel для отмены. Не используйте форматирование здесь.

# admin-tour
source: Great! Now send me the description for the tour (or send /cancel to abort). It will be visible when a user will try to purchase the tour. You can use formatting here.
ru: Отлично! Теперь пришлите мне описание экскурсии (или пошлите /cancel для отмены). Это описание будет видно, когда пользователь попытается купить тур. Можно использовать форматирование.

# admin-tour
source: Terrific! Let's add some content now! Send me the title for the new section.
ru: Супер! Давай добавлять контент. Отправь мне название нового раздела.

# admin-tours
source: Done!
ru: Готово!

# admin-tour
source: Now send me location, text, photo, audio, video, animation, voice or video note messages, and send /done when finished with the section.
ru: Отправить мне локацию, текст, фото, аудио, видео, анимацию, голосовое сообщение или видео заметку, и отправьте /done чтобы закончить с созданием раздела.

# admin-tours
source: Done! Send me the title of the next tour section, or send /done if you're finished.
ru: Готово! Пришлите мне название следующего раздела или отправьте /done, чтобы закончить с экскурсией.

# admin-tour
source: Add a tour
ru: Добавить экскурсию

# admin-tour
source: Please select the language for the new tour.
ru: Пожалуйста, выберите язык для новой экскурсии.

# bot-generic
source: Cancelled.
ru: Отменено.

# admin-tours
source: The text was added to the section!
ru: Текст был добавлен в раздел!

# admin-tours
source: Add more data or send /done if you're finished with the section.
ru: Добавьте больше данных или отправьте /done если вы закончили раздел.

# admin-tours
source: The animation was added to the section!
ru: Анимация была добавлена в раздел!

# admin-tours
source: The location was added to the section!
ru: Локация была добавлена в раздел!

# admin-tours
source: The voice was added to the section!
ru: Голосовое сообщение было добавлено в раздел!

# admin-tours
source: The video note was added to the section!
ru: Видео заметка была добавлена в раздел!

# admin-tours
source: Something went wrong when I tried to download your audio (see the details in the logs). What should I do now?
ru: Что-то пошло не так, когда я пытался загрузить звук (проверьте подробности в логах). Что мне делать сейчас?

# bot-generic
source: Try again
ru: Попробовать снова

# admin-tours
source: Store the original audio
ru: Сохранить оригинальную аудиозапись

# admin-tours
source: File downloaded, converting...
ru: Файл загружен, конвертируется...

# admin-tours
source: Something went wrong when I tried to convert the file. What should I do now?
ru: Что-то пошло не так при попытке конвертировать файл. Что мне сделать сейчас?

# admin-tours
source: File converted, uploading...
ru: Файл сконвертирован, загружается...

# bot-generic
source: Store the voice message
ru: Сохранить голосовое сообщение

# admin-tours
source: Something went wrong when I tried to upload the file. What should I do now?
ru: Что-то пошло не так при попытке загрузить файл. Что мне сделать сейчас?

# admin-tours
source: The audio was converted successfully. Please check the quality and decide what do you want to do with it.
ru: Аудио было успешно сконвертировано. Пожалуйста, проверьте качество и решите, что вы хотите сделать с ним дальше.

# admin-tours
source: Starting the audio conversion process...
ru: Запускается процесс конвертации аудиозаписи...

# admin-tours
source: Audio-to-voice conversion suggestions have been disabled. You can enabled them again using /configure command in the admin mode.
ru: Конвертация аудиозаписей в голосовые сообщения отключена. Вы можете включить её снова с помощью команды /configure в режиме администратора.

# admin-tours
source: The audio was added to the section!
ru: Аудио-файл был добавлен в раздел!

# admin-tours
source: Please wait until all audios in the group are uploaded before proceeding to the next section.
ru: Пожалуйста, дождитесь загрузки всех аудиофайлов в группе, прежде чем перейти к следующему разделу.

# admin-tours
source: Would you like to convert this audio file to a voice message?
ru: Вы хотите преобразовать эту аудиозапись в голосовое сообщение?

# bot-generic
source: No
ru: Нет

# admin-tours
source: No, and do not ask again.
ru: Нет, и не спрашивать снова.

# admin-tours
source: The video was added to the section!
ru: Видео было добавлено в раздел!

# admin-tours
source: Please wait until all videos in the group are uploaded before proceeding to the next section.
ru: Пожалуйста, дождитесь загрузки всех видео в группе, прежде чем перейти к следующему разделу.

# admin-tours
source: The photo was added to the section!
ru: Фотография была добавлена в раздел!

# admin-tours
source: Please wait until all photos in the group are uploaded before proceeding to the next section.
ru: Пожалуйста, дождитесь загрузки всех фотографий в группе, прежде чем перейти к следующему разделу.

# admin-tours
source: Unsupported message! Please send me one of the following to add to the tour section: location, text, photo, audio, video, animation, voice or video note.
ru: Неподдерживаемое сообщение! Только следующие сообщения можно добавить в экскурсии: локация, текст, фото, аудио, видео, анимация, голосовое сообщение или видео заметка.

# admin-tour
source: Delete a tour
ru: Удалить экскурсию

# admin-tours
source: Do you really want to delete the tour "{0}"?
ru: Вы действительно хотите удалить экскурсию "{0}"?

# admin-tours
source: The tour "{0}" was removed.
ru: Экскурсия "{0}" удалена.

# admin-tour
source: Please select the tour you want to delete.
ru: Пожалуйста, выберите экскурсию, которую вы хотите удалить.

# admin-tours
source: Please select the language you want to update. Keep in mind that you have to set the price for each language the tour has in order to everything work properly.
ru: Пожалуйста, выберите язык, который вы хотите обновить. Имейте в виду, что вы должны установить цену для каждого языка, на котором доступна экскурсия, чтобы все работало должным образом.

# admin-tours
source: Please send me the currency in which you want to charge your users, or /cancel to abort.
ru: Пожалуйста, пришлите мне валюту, в которой вы хотите взимать плату с пользователей, или /cancel для отмены.

# admin-tours
source: You can find more details about available currencies <a href='https://core.telegram.org/bots/payments#supported-currencies'>here</a>.
ru: Вы можете найти всю необходимую информацию про доступные валюты <a href='https://core.telegram.org/bots/payments#supported-currencies'>тут</a>.

# admin-tours
source: Unknown currency provided. Please try again.
ru: Указана неизвестная валюта. Пожалуйста, попробуйте еще раз.

# admin-tours
source: Please send me the price of the tour in {}.
ru: Пожалуйста, пришлите мне цену экскурсии в {}.

# admin-tours
source: Invalid value provided, please try again.
ru: Введено неверное значение, попробуйте еще раз.

# admin-tours
source: How long (in days) {} should buy?
ru: Сколько времени (в днях) {} должно предоставлять?

# admin-tours
source: Please send me the title to display with the purchase (max 32 chars; no formatting), or /cancel to abort.
ru: Пожалуйста, пришлите мне заголовок для отображения в счёте на оплату (не более 32 символов; без форматирования) или /cancel на отмену.

# admin-tours
source: Title is too long. You sent {len} characters, but it should be 32 max. Please try again.
ru: Заголовок слишком длинный. Вы отправили {len} символов, но он должно быть не более 32 символов. Пожалуйста, попробуйте еще раз.

# admin-tours
source: Please send me the description of the tour to be displayed in an invoice (255 chars max; no formatting).
ru: Пожалуйста, пришлите мне описание экскурсии, которое будет отображаться в счете на оплату (максимум 255 символов; без форматирования).

# admin-tours
source: Description is too long. You sent {len} characters, but it should be 255 max. Please try again.
ru: Описание слишком длинное. Вы отправили {len} символов, но оно должно быть не более 255 символов. Пожалуйста, попробуйте еще раз.

# guest-bot-command
source: Enter admin mode
ru: Войти в режим администратора

# guest-bot-command
source: Display the welcome message again
ru: Показать приветственное сообщение еще раз

# guest-bot-command
source: Show available tours
ru: Показать доступные экскурсии

# guest-bot-command
source: Purchase (or extend) access to a tour
ru: Покупка (или продление) доступа к экскурсии

# guest-bot-command
source: Change the language
ru: Изменить язык

# guest-bot-command
source: Display terms & conditions
ru: Показать условия использования

# guest-bot-command
source: Display how to contact the support
ru: Показать как связаться со службой поддержки

# guest-help
source: You can use the following commands: * /start — to see the welcome message again * /tours — to list all the available for you tours * /terms — display terms & conditions * /support — to see how to contact the support * /language — to change the interface language
ru: Вы можете использовать следующие команды: * /start — отобразить приветственное сообщение * /tours — список всех доступных для вас экскурсий * /terms — показать условия использования * /support — узнать, как связаться со службой поддержки * /language — изменить язык интерфейса

# guest-help
source: There are no terms & conditions yet. Please, try again later.
ru: Условия использования пока не опубликованы. Пожалуйста, повторите попытку позже.

# guest-help
source: There are no support details yet. Please, try again later.
ru: Сведения о поддержке пока отсутствуют. Пожалуйста, повторите попытку позже.

# guest-tour-purchase
source: Thank you for the purchase! You can now access the tour by sending /tours and following the instructions. Access to the tour will expire at {} UTC.
ru: Спасибо за покупку! Теперь вы можете получить доступ к экскурсии, отправив /tours и следуя инструкциям. Доступ к туру истекает {} UTC.

# guest-tour-purchase
source: {} day access
ru: Доступ на {} день

# guest-tour-purchase
source: Please select the tour you want to purchase. You'll see the description of the tour after you select it.
ru: Пожалуйста, выберите экскурсию, которую вы хотите купить. Вы увидите описание экскурсии, после выбора.

# guest-tour-purchase
source: Unfortunately, there are no tours available for purchase online at the moment.
ru: К сожалению, в данный момент нет экскурсий доступных для покупки онлайн.

# guest-bot-start
source: Share phone number
ru: Поделиться номером телефона

# guest-bot-start
source: Please send me your phone number using the "Share phone number" button.
ru: Пожалуйста, пришлите мне свой номер телефона, воспользовавшись кнопкой "Поделиться номером телефона".

# guest-bot-start
source: Unexpected command received. You can only use /language to change the interface language at this stage.
ru: Получена неожиданная команда. Сейчас Вы можете использовать только команду /language, для изменения языка интерфейса.

# guest-bot-start
source: Please send me your contact number and not somebody else's.
ru: Мне нужен ваш номер телефона, а не кого-то из ваших знакомых.

# guest-bot-start
source: I see you have a tour available; thank you for the support! Send /tours to start exploring!
ru: Вам доступна экскурсия; спасибо за поддержку! Отправьте /tours чтобы начать изучение.

# guest-tour
source: Unfortunately, no tours are available for you at the moment. Approving somebody for a tour takes a while, but if you feel like a mistake was made, don't hesitate to contact me! The bot's profile should provide all the required info.
ru: К сожалению, в данный момент у вас нет ни одной экскурсии. Одобрение кого-нибудь для экскурсии занимает некоторое время, но если вы чувствуете, что произошла ошибка, не стесняйтесь связаться со мной! В профиле бота должна быть вся необходимая информация.

# guest-bot-start
source: The bot is not configured yet; please try again later.
ru: Бот еще не настроен; пожалуйста, повторите попытку позже.

# guest-bot-start
source: I don't recognize you! Please send me your phone number.
ru: Я вас не узнаю! Пожалуйста, отправьте мне ваш номер телефона.

# guide-tour
source: Are you ready to continue?
ru: Вы готовы продолжить?

# guide-tour
source: Next section
ru: Следующий раздел

# cli
source: Tour #{0} doesn't have a language {1} preferred by the user {2}.
ru: Экскурсия #{0} не имеет языка {1} предпочитаемого пользователем {2}.

# cli
source: Tour #{0} doesn't have a default app language {1}.
ru: Экскурсия #{0} не имеет языка приложения по умолчанию {1}.

# guide-tour
source: Unfortunately, you don't have access to the requested tour.
ru: К сожалению, у вас нет доступа к запрошенной экскурсии.

# guest-tour
source: Only one tour is available for you: {}.
ru: Вам доступна только одна экскурсия: {}.

# guest-tour
source: You have selected the tour {}.
ru: Вы выбрали экскурсию {}.

# guest-tour
source: Now the bot will send you several messages, please start the tour with the following one 👇
ru: Сейчас бот отправит вам несколько сообщений, пожалуйста, начните экскурсию с первого👇
