Repository: andrey-yantsen/TourGuideBot-tg
Catalog: tour_guide_bot/locales/*/LC_MESSAGES/tour_guide_bot.po
Languages: ru

# guide-tour
source: Please select a tour you want to start.
ru: Пожалуйста, выберите экскурсию, которую вы хотите начать.

# bot-generic
source: The language has been changed to {0}.
ru: Язык был изменён на {0}.

# bot-generic
source: Please select the language you prefer
ru: Пожалуйста, выберите предпочитаемый язык

# bot-generic
source: Unfortunately, you can`t change the language — this bot supports only one.
ru: К сожалению, вы не можете изменить язык — этот бот поддерживает только один.

# admin-bot
source: Access denied.
ru: Доступ запрещен.

# bot-generic
source: Tour #{0} doesn't have any translations.
ru: Экскурсия #{0} не имеет каких-либо переводов.

# bot-generic
source: Tour #{0} doesn't have a translation for the default language ({1}).
ru: Тур #{0} не имеет перевода для языка по умолчанию ({1}).

# bot-generic
source: No tours found.
ru: Экскурсии не найдены.

# web-auth
source: Invalid hash
ru: Некорректная подпись

# web-auth
source: Data is too old
ru: Слишком старые данные

# web-auth
source: Please log in
ru: Пожалуйста, войдите в систему

# web-generic
source: Toggle navigation
ru: Переключить навигацию

# web-menu
source: Home
ru: Главная

# web-menu
source: Tours
ru: Экскурсии

# web-menu
source: Guests access
ru: Доступ к экскурсиям

# web-menu
source: Configuration
ru: Конфигурирование

# web-generic
source: Basic settings
ru: Базовые настройки

# web-generic
source: Suggest audio to voice conversion
ru: Предлагать конвертировать аудио в голосовые сообщения

# web-generic
source: Messages
ru: Сообщения

# web-generic
source: Payment settings
ru: Настройки оплаты
